// ----------------------------------------------------------
// This Source Code Form is subject to the terms of the
// Mozilla Public License, v.2.0. If a copy of the MPL
// was not distributed with this file, You can obtain one
// at http://mozilla.org/MPL/2.0/.
// ----------------------------------------------------------
// Codebase: https://github.com/ArKuznetsov/irac/
// ----------------------------------------------------------

#Использовать 1testrunner

Процедура ПровестиТестирование()
	
	Тестер = Новый Тестер;

	КаталогПроекта = ОбъединитьПути(ТекущийСценарий().Каталог, "..");
	КаталогРезультатовТестов = Новый Файл(ОбъединитьПути(КаталогПроекта, "test-reports"));
	Если Не КаталогРезультатовТестов.Существует() Тогда
		СоздатьКаталог(КаталогРезультатовТестов.ПолноеИмя);
	КонецЕсли;

	ФайлРезультатовТестовПакета = Новый Файл(КаталогРезультатовТестов.ПолноеИмя);
	КаталогТестов = Новый Файл(ОбъединитьПути(КаталогПроекта, "tests"));

	Тестер.УстановитьФорматЛогФайла(Тестер.ФорматыЛогФайла().GenericExec);
	
	Тестер.ТестироватьКаталог(КаталогТестов, ФайлРезультатовТестовПакета);

КонецПроцедуры

ПровестиТестирование();
