Перем ПараметрыКластера;

// Процедура устанавливает вывод функции ВыполнитьКоманду мок-исполнителя команд
//
// Параметры:
//	ИсполнительКоманд	- МокИсполнительКоманд		- мок-объект исполнитель команд
//	ПутьКДанным			- Строка					- Путь к параметрам в структуре параметров кластера
//	
Процедура УстановитьВыводИсполнителяКоманд(ИсполнительКоманд, ПутьКДанным) Экспорт

	МассивПутей = СтрРазделить(ПутьКДанным, ".");

	Данные = ПараметрыКластера;

	Для Каждого ТекПуть Из МассивПутей Цикл
		Данные = Данные[ТекПуть];
	КонецЦикла;

	ИсполнительКоманд.Когда().ВыполнитьКоманду(Данные.ПараметрыКоманды).ТогдаВозвращает(Данные.ВыводКоманды);

КонецПроцедуры // УстановитьВыводИсполнителяКомандНов()

Функция Агент_СтрокаПодключения()

	Возврат "localhost:1545";

КонецФункции

Функция Кластер_Ид()

	Возврат "6d6958ed-a96c-4999-a995-698a0298161e";

КонецФункции

Функция Кластер_СтрокаАвторизации()

	Возврат "";

КонецФункции

Функция Сервер_Ид()

	Возврат "48336b15-d0e0-4c1e-9e9c-49fabfbd0ab5";

КонецФункции

Функция Вывод_КластерыСписок()
	
	ПараметрыЗапуска = Новый Массив();
	ПараметрыЗапуска.Добавить(Агент_СтрокаПодключения());
	ПараметрыЗапуска.Добавить("cluster");
	ПараметрыЗапуска.Добавить("list");
	
	ВыводКоманды = "cluster                       : " + Кластер_Ид() + "
					|host                          : Sport1
					|port                          : 1541
					|name                          : ""Локальный кластер""
					|expiration-timeout            : 0
					|lifetime-limit                : 0
					|max-memory-size               : 0
					|max-memory-time-limit         : 0
					|security-level                : 0
					|session-fault-tolerance-level : 0
					|load-balancing-mode           : performance
					|errors-count-threshold        : 0
					|kill-problem-processes        : 0
					|
					|";

	Возврат Новый Структура("ПараметрыКоманды, ВыводКоманды", ПараметрыЗапуска, ВыводКоманды);

КонецФункции // Вывод_КластерыСписок()

Функция Вывод_МенеджерыСписок()
	
	ПараметрыЗапуска = Новый Массив();
	ПараметрыЗапуска.Добавить(Агент_СтрокаПодключения());

	ПараметрыЗапуска.Добавить("manager");
	ПараметрыЗапуска.Добавить("list");

	ПараметрыЗапуска.Добавить(СтрШаблон("--cluster=%1", Кластер_Ид()));
	ПараметрыЗапуска.Добавить(Кластер_СтрокаАвторизации());

	ВыводКоманды = "manager : 0e588a25-8354-4344-b935-53442312aa30
					|pid     : 3388
					|using   : normal
					|host    : Sport1
					|port    : 1541
					|descr   : ""Главный менеджер кластера""
					|
					|";

	Возврат Новый Структура("ПараметрыКоманды, ВыводКоманды", ПараметрыЗапуска, ВыводКоманды);

КонецФункции // Вывод_МенеджерыСписок()

Функция Вывод_СерверыСписок()
	
	ПараметрыЗапуска = Новый Массив();
	ПараметрыЗапуска.Добавить(Агент_СтрокаПодключения());

	ПараметрыЗапуска.Добавить("server");
	ПараметрыЗапуска.Добавить("list");

	ПараметрыЗапуска.Добавить(СтрШаблон("--cluster=%1", Кластер_Ид()));
	ПараметрыЗапуска.Добавить(Кластер_СтрокаАвторизации());

	ВыводКоманды = "server                              : " + Сервер_Ид() + "
					|agent-host                          : Sport1
					|agent-port                          : 1540
					|port-range                          : 1560:1591
					|name                                : ""Центральный сервер""
					|using                               : main
					|dedicate-managers                   : none
					|infobases-limit                     : 8
					|memory-limit                        : 0
					|connections-limit                   : 128
					|safe-working-processes-memory-limit : 0
					|safe-call-memory-limit              : 0
					|cluster-port                        : 1541
					|
					|";

	Возврат Новый Структура("ПараметрыКоманды, ВыводКоманды", ПараметрыЗапуска, ВыводКоманды);

КонецФункции // Вывод_СерверыСписок()

Функция Вывод_СерверыПараметры()
	
	ПараметрыЗапуска = Новый Массив();
	ПараметрыЗапуска.Добавить(Агент_СтрокаПодключения());

	ПараметрыЗапуска.Добавить("server");
	ПараметрыЗапуска.Добавить("info");

	ПараметрыЗапуска.Добавить(СтрШаблон("--server=%1", Сервер_Ид()));
	ПараметрыЗапуска.Добавить(СтрШаблон("--cluster=%1", Кластер_Ид()));
	ПараметрыЗапуска.Добавить(Кластер_СтрокаАвторизации());

	ВыводКоманды = "server                              : " + Сервер_Ид() + "
					|agent-host                          : Sport1
					|agent-port                          : 1540
					|port-range                          : 1560:1591
					|name                                : ""Центральный сервер""
					|using                               : main
					|dedicate-managers                   : none
					|infobases-limit                     : 8
					|memory-limit                        : 0
					|connections-limit                   : 128
					|safe-working-processes-memory-limit : 0
					|safe-call-memory-limit              : 0
					|cluster-port                        : 1541
					|
					|";

Возврат Новый Структура("ПараметрыКоманды, ВыводКоманды", ПараметрыЗапуска, ВыводКоманды);

КонецФункции // Вывод_СерверыПараметры()

Функция Вывод_РабочиеПроцессыСписок()
	
	ПараметрыЗапуска = Новый Массив();
	ПараметрыЗапуска.Добавить(Агент_СтрокаПодключения());

	ПараметрыЗапуска.Добавить("process");
	ПараметрыЗапуска.Добавить("list");

	ПараметрыЗапуска.Добавить(СтрШаблон("--cluster=%1", Кластер_Ид()));
	ПараметрыЗапуска.Добавить(Кластер_СтрокаАвторизации());

	ВыводКоманды = "process              : 3ea9968d-159c-4b5f-9bdc-22b8ead96f74
					|host                 : Sport1
					|port                 : 1564
					|pid                  : 5428
					|is-enable            : yes
					|running              : yes
					|started-at           : 2018-03-29T11:16:02
					|use                  : used
					|available-perfomance : 100
					|capacity             : 1000
					|connections          : 7
					|memory-size          : 1518604
					|memory-excess-time   : 0
					|selection-size       : 61341
					|avg-back-call-time   : 0.000
					|avg-call-time        : 0.483
					|avg-db-call-time     : 0.124
					|avg-lock-call-time   : 0.000
					|avg-server-call-time : -0.265
					|avg-threads          : 0.281
					|
					|process              : 1af2e54f-d95a-4370-9b45-8277280cad23
					|host                 : Sport1
					|port                 : 1561
					|pid                  : 7856
					|is-enable            : yes
					|running              : yes
					|started-at           : 2018-04-03T18:42:45
					|use                  : used
					|available-perfomance : 100
					|capacity             : 1000
					|connections          : 19
					|memory-size          : 4598160
					|memory-excess-time   : 0
					|selection-size       : 169046
					|avg-back-call-time   : 0.000
					|avg-call-time        : 0.731
					|avg-db-call-time     : 0.140
					|avg-lock-call-time   : 0.000
					|avg-server-call-time : 0.133
					|avg-threads          : 2.088
					|
					|";

	Возврат Новый Структура("ПараметрыКоманды, ВыводКоманды", ПараметрыЗапуска, ВыводКоманды);

КонецФункции // Вывод_РабочиеПроцессыСписок()

Функция Вывод_СервисыСписок()
	
	ПараметрыЗапуска = Новый Массив();
	ПараметрыЗапуска.Добавить(Агент_СтрокаПодключения());

	ПараметрыЗапуска.Добавить("service");
	ПараметрыЗапуска.Добавить("list");

	ПараметрыЗапуска.Добавить(СтрШаблон("--cluster=%1", Кластер_Ид()));
	ПараметрыЗапуска.Добавить(Кластер_СтрокаАвторизации());

	ВыводКоманды = "name      : LicenseService
					|main-only : 0
					|manager   : 0e588a25-8354-4344-b935-53442312aa30
					|descr     : ""Сервис лицензирования""
					|
					|name      : EventLogService
					|main-only : 0
					|manager   : 0e588a25-8354-4344-b935-53442312aa30
					|descr     : ""Сервис журналов регистрации""
					|
					|name      : OpenID2ProviderContextService
					|main-only : 0
					|manager   : 0e588a25-8354-4344-b935-53442312aa30
					|descr     : ""Сервис провайдера OpenID2""
					|
					|name      : TimestampService
					|main-only : 0
					|manager   : 0e588a25-8354-4344-b935-53442312aa30
					|descr     : ""Сервис времени""
					|
					|name      : SessionReuseService
					|main-only : 0
					|manager   : 0e588a25-8354-4344-b935-53442312aa30
					|descr     : ""Сервис повторного использования сеансов""
					|
					|name      : SessionDataService
					|main-only : 0
					|manager   : 0e588a25-8354-4344-b935-53442312aa30
					|descr     : ""Сервис сеансовых данных""
					|
					|name      : ExternalSessionManagerService
					|main-only : 0
					|manager   : 0e588a25-8354-4344-b935-53442312aa30
					|descr     : ""Сервис внешнего управления сеансами""
					|
					|name      : FulltextSearchService
					|main-only : 0
					|manager   : 0e588a25-8354-4344-b935-53442312aa30
					|descr     : ""Сервис полнотекстового поиска""
					|
					|name      : TransactionLockService
					|main-only : 0
					|manager   : 0e588a25-8354-4344-b935-53442312aa30
					|descr     : ""Сервис транзакционных блокировок""
					|
					|name      : DebugService
					|main-only : 1
					|manager   : 0e588a25-8354-4344-b935-53442312aa30
					|descr     : ""Сервис управления предметами отладки (TCP)""
					|
					|name      : ClusterConfigService
					|main-only : 1
					|manager   : 0e588a25-8354-4344-b935-53442312aa30
					|descr     : ""Сервис конфигурации кластера""
					|
					|name      : ClientTestingService
					|main-only : 0
					|manager   : 0e588a25-8354-4344-b935-53442312aa30
					|descr     : ""Сервис тестирования""
					|
					|name      : ClusterLockService
					|main-only : 1
					|manager   : 0e588a25-8354-4344-b935-53442312aa30
					|descr     : ""Сервис блокировок кластера""
					|
					|name      : JobService
					|main-only : 0
					|manager   : 0e588a25-8354-4344-b935-53442312aa30
					|descr     : ""Сервис заданий""
					|
					|name      : ExternalDataSourceXMLAService
					|main-only : 0
					|manager   : 0e588a25-8354-4344-b935-53442312aa30
					|descr     : ""Сервис работы с внешними источниками данных через XMLA""
					|
					|name      : SettingsService
					|main-only : 0
					|manager   : 0e588a25-8354-4344-b935-53442312aa30
					|descr     : ""Сервис пользовательских настроек""
					|
					|name      : ExternalDataSourceODBCService
					|main-only : 0
					|manager   : 0e588a25-8354-4344-b935-53442312aa30
					|descr     : ""Сервис работы с внешними источниками данных через ODBC""
					|
					|name      : NumerationService
					|main-only : 0
					|manager   : 0e588a25-8354-4344-b935-53442312aa30
					|descr     : ""Сервис нумерации""
					|
					|name      : DataEditLockService
					|main-only : 0
					|manager   : 0e588a25-8354-4344-b935-53442312aa30
					|descr     : ""Сервис блокировки объектов""
					|
					|name      : AuxiliaryService
					|main-only : 0
					|manager   : 0e588a25-8354-4344-b935-53442312aa30
					|descr     : ""Сервис вспомогательных функций кластера""
					|
					|name      : DataBaseConfigurationUpdateService
					|main-only : 0
					|manager   : 0e588a25-8354-4344-b935-53442312aa30
					|descr     : ""Сервис обновления конфигурации базы данных""
					|		
					|";

	Возврат Новый Структура("ПараметрыКоманды, ВыводКоманды", ПараметрыЗапуска, ВыводКоманды);

КонецФункции // Вывод_СервисыСписок()

Функция Вывод_ИБСписок()
	
	ПараметрыЗапуска = Новый Массив();
	ПараметрыЗапуска.Добавить(Агент_СтрокаПодключения());

	ПараметрыЗапуска.Добавить("infobase");
	ПараметрыЗапуска.Добавить("summary");
	ПараметрыЗапуска.Добавить("list");

	ПараметрыЗапуска.Добавить(СтрШаблон("--cluster=%1", Кластер_Ид()));
	ПараметрыЗапуска.Добавить(Кластер_СтрокаАвторизации());

	ВыводКоманды = "infobase : feba16a9-3bb0-4fc9-b940-0f1ab933c539
					|name     : DEV_User1_ACC_Cust1
					|descr    : 
					|
					|infobase : aea71760-15b3-485a-9a35-506eb8a0b04a
					|name     : DEV_User1_TRADE_Cust1
					|descr    : 
					|
					|infobase : 7e468bc0-01f3-45d1-bed5-d5ec344aefb3
					|name     : DEV_User1_ACC_Cust2
					|descr    : 
					|
					|infobase : 76e63eea-c3d8-48d7-8e3c-ba80aaedbce9
					|name     : DEV_User2_TRADE_Cust2
					|descr    : 
					|
					|infobase : d8ee553b-9701-4d65-b385-599eaf1b3a54
					|name     : DEV_User3_ACC_Cust1
					|descr    : 
					|
					|";

	Возврат Новый Структура("ПараметрыКоманды, ВыводКоманды", ПараметрыЗапуска, ВыводКоманды);

КонецФункции // Вывод_ИБСписок()

Функция Вывод_НазначенияФункциональностиСписок()
	
	ПараметрыЗапуска = Новый Массив();
	ПараметрыЗапуска.Добавить(Агент_СтрокаПодключения());

	ПараметрыЗапуска.Добавить("rule");
	ПараметрыЗапуска.Добавить("list");

	ПараметрыЗапуска.Добавить(СтрШаблон("--server=%1", Сервер_Ид()));
	ПараметрыЗапуска.Добавить(СтрШаблон("--cluster=%1", Кластер_Ид()));
	ПараметрыЗапуска.Добавить(Кластер_СтрокаАвторизации());

	ВыводКоманды = "rule            : 2aae9067-8fff-4aa7-a87b-e9c354879029
					|object-type     : ""Connection""
					|infobase-name   : DEV_User1_TRADE_Cust1
					|rule-type       : always
					|application-ext : 
					|priority        : 0
					|
					|rule            : 269f9796-a3fa-4370-ae56-558a5d00d6c0
					|object-type     : 
					|infobase-name   : DEV_User2_TRADE_Cust2
					|rule-type       : auto
					|application-ext : BacgroundJob
					|priority        : 0
					|
					|";

	Возврат Новый Структура("ПараметрыКоманды, ВыводКоманды", ПараметрыЗапуска, ВыводКоманды);

КонецФункции // Вывод_НазначенияФункциональностиСписок()

Функция Вывод_ПрофилиБезопасностиСписок()
	
	ПараметрыЗапуска = Новый Массив();
	ПараметрыЗапуска.Добавить(Агент_СтрокаПодключения());
	
	ПараметрыЗапуска.Добавить("profile");
	ПараметрыЗапуска.Добавить("list");
	
	ПараметрыЗапуска.Добавить(СтрШаблон("--cluster=%1", Кластер_Ид()));
	ПараметрыЗапуска.Добавить(Кластер_СтрокаАвторизации());
	
	ВыводКоманды = "name                                : ОсновнойПрофиль
					|descr                               : Основной профиль безопасности
					|config                              : no
					|priv                                : no
					|directory                           : list
					|com                                 : list
					|addin                               : list
					|module                              : list
					|app                                 : list
					|inet                                : list
					|crypto                              : no
					|right-extension                     : no
					|right-extension-definition-roles    : 
					|all-modules-extension               : no
					|modules-available-for-extension     : 
					|modules-not-available-for-extension : 
					|
					|";
	
	Возврат Новый Структура("ПараметрыКоманды, ВыводКоманды", ПараметрыЗапуска, ВыводКоманды);

КонецФункции // Вывод_ПрофилиБезопасностиСписок()

Процедура Инициализация()
	
	Лог = Логирование.ПолучитьЛог("ktb.lib.irac");

	ПараметрыКластера = Новый Структура();
	
	ПараметрыКластера.Вставить("Кластеры",
		Новый Структура("Список, Параметры, Добавить, Изменить, Удалить",
						Вывод_КластерыСписок(),
						Неопределено,
						Неопределено,
						Неопределено,
						Неопределено));

	ПараметрыКластера.Вставить("Менеджеры",
		Новый Структура("Список, Параметры",
						Вывод_МенеджерыСписок(),
						Неопределено));

	ПараметрыКластера.Вставить("Серверы",
		Новый Структура("Список, Параметры, Добавить, Изменить, Удалить",
						Вывод_СерверыСписок(),
						Вывод_СерверыПараметры(),
						Неопределено,
						Неопределено,
						Неопределено));

	ПараметрыКластера.Вставить("РабочиеПроцессы",
		Новый Структура("Список, Параметры",
						Вывод_РабочиеПроцессыСписок(),
						Неопределено));

	ПараметрыКластера.Вставить("Сервисы",
		Новый Структура("Список, Параметры",
						Вывод_СервисыСписок(),
						Неопределено));

	ПараметрыКластера.Вставить("ИБ",
		Новый Структура("Список, Параметры, ПараметрыСокр, Добавить, Изменить, Удалить",
						Вывод_ИБСписок(),
						Неопределено,
						Неопределено,
						Неопределено,
						Неопределено));

	ПараметрыКластера.Вставить("НазначенияФункциональности",
		Новый Структура("Список, Параметры, Добавить, Изменить, Удалить",
						Вывод_НазначенияФункциональностиСписок(),
						Неопределено,
						Неопределено,
						Неопределено,
						Неопределено));

	ПараметрыКластера.Вставить("ПрофилиБезопасности",
		Новый Структура("Список, Параметры, Добавить, Изменить, Удалить",
						Вывод_ПрофилиБезопасностиСписок(),
						Неопределено,
						Неопределено,
						Неопределено,
						Неопределено));

КонецПроцедуры

Инициализация();